In [1]:
import numpy as np
import pandas as pd
import plotly.express as px

In [2]:
df = pd.read_excel("phillystops.xlsx")

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 631997 entries, 0 to 631996
Data columns (total 14 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   date          631997 non-null  object
 1   dayweek       631997 non-null  object
 2   year          631997 non-null  int64
 3   location      631797 non-null  object
 4   latitude      631997 non-null  float64
 5   longitude     631997 non-null  float64
 6   district      631996 non-null  float64
 7   servicearea   631738 non-null  float64
 8   race          631997 non-null  object
 9   age           630025 non-null  float64
 10  gender        631692 non-null  object
 11  arrest        631997 non-null  bool
 12  frisk         631997 non-null  bool
 13  searchperson  631997 non-null  bool
dtypes: bool(3), float64(5), int64(1), object(5)
memory usage: 54.8+ MB

In [8]:
print(df.arrest.value_counts())
print(df.frisk.value_counts())
print(df.searchperson.value_counts())

False    568100
True      63897
Name: arrest, dtype: int64
False    542945
True      89052
Name: frisk, dtype: int64
False    572597
True      59400
Name: searchperson, dtype: int64

In [12]:
gender = pd.pivot_table(df, values=['arrest', 'frisk', 'searchperson'], index=[], columns=['gender'], aggfunc=np.sum)
gender

gender        female   male
arrest         10526  53338
frisk           5223  83776
searchperson    8946  50429

In [13]:
race = pd.pivot_table(df, values=['arrest', 'frisk', 'searchperson'], index=[], columns=['race'], aggfunc=np.sum)
race

race,American Indian,Asian,Black - Latino,Black - Non-Latino,Unknown,White - Latino,White - Non-Latino
arrest,46,418,1315,43028,221,6571,12298
frisk,75,561,1320,67921,333,7903,10939
searchperson,43,440,1377,39470,219,6400,11451

In [14]:
year = pd.pivot_table(df, values=['arrest', 'frisk', 'searchperson'], index=[], columns=['year'], aggfunc=np.sum)
year

year           2014   2015   2016   2017
arrest        18862  19478  13909  11648
frisk         30280  25285  19287  14200
searchperson  16755  16577  14008  12060

In [20]:
cols = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday']
dayweek = pd.pivot_table(df, values=['arrest', 'frisk', 'searchperson'], index=[], columns=['dayweek'], aggfunc=np.sum)
dayweek = dayweek[cols]
dayweek

dayweek       Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
arrest          7229    10166      10665     10487   10053      9091    6206
frisk          10175    14188      14409     14178   13828     12940    9334
searchperson    6451     9621       9990      9952    9376      8235    5775

In [23]:
district = pd.pivot_table(df, values=['arrest', 'frisk', 'searchperson'], index=[], columns=['district'], aggfunc=np.sum)
district

district,1.0,2.0,3.0,5.0,6.0,7.0,8.0,9.0,12.0,14.0,...,17.0,18.0,19.0,22.0,24.0,25.0,26.0,35.0,39.0,77.0
arrest,1518,2681,1955,424,1488,297,436,1513,4899,2864,...,2168,3370,6812,4254,9272,6061,2351,3756,2392,98
frisk,1925,3419,2501,447,1521,481,525,1285,6004,6934,...,3782,5008,5991,8654,9077,8235,2363,7388,4898,75
searchperson,1566,1915,2086,462,1172,342,489,1410,3887,2747,...,2054,3789,3559,4541,8919,6206,2263,3601,2805,109